{"0":{"0":"The Computer SocietySeptember 2015 to PresentA non-profit student organization at Texas Southern University that aims to help students overcome the digital divide.","1":"Master MasonJanuary 1990 to PresentMaster Mason of the Fraternity of Free and Accepted Masons","2":"Work Study - Computer VisionSeptember 2018 to PresentResearcher and Software Engineer for Architectural Department at Drexel University• Researched various machine learning methods for use in image difference detection• Using OpenCV to build an image difference detector. SVM + HOG approach.Senior Design ProjectSeptember 2018 to PresentMachine Learning Researcher and Software Engineer• Researched various machine learning algorithms for use in ASL recognition• Used CUDA libraries for GPU Programming.","3":"Epsilon pi upsilonJanuary 2016 to April 2018Computer Science Society","4":"IEEE - Lokmanya Tilak College of Engineering, University of MumbaiOctober 2011 to October 2013Member","5":"IEEE Computer SocietyOctober 2001 to PresentAssociation for Computing MachineryMarch 2001 to Present","6":"Harborview ToastmastersJanuary 2017 to PresentVice President of Public Relations - June 2018 - CurrentToastmasters International is a US headquartered nonprofit educational organization that operates clubs worldwide for the purpose of promoting communication, public speaking, and leadership skills","7":"Miami Carol City Football TeamSeptember 1999 to June 2002MVP of the team, skill position player","8":"I.B.P.O.Elks of the worldSeptember 2006 to PresentI am a member of this fine fraternity which offers charity and love to less fortunate communities and families.I have been an active member for the past 13 years and holding the seat of National Chief Recorder.","9":"young marine alumniJanuary 2015 to Present","10":"CDW Advisory Board (small business)Present","11":"Alpha Phi Alpha Fraternity, Inc.November 2004 to PresentAlpha Phi Alpha Fraternity, Inc. develops leaders, promotes brotherhood and academic excellence, while providing service and advocacy for our communities.National Society of Black EngineersAugust 2007 to May 2011NSBE mission is \"to increase the number of culturally responsible Black engineers who excel academically, succeed professionally, and positively impact the community\".Institute of Electrical and Electronics EngineersAugust 2007 to May 2011IEEE is a professional association formed in 1963 from the amalgamation of the American Institute of Electrical Engineers and the Institute of Radio Engineers.","12":"Vice President\/President of IEEE Gonzaga University ChapterJanuary 2018 to PresentInstrumentally engaged in educating students in professional and technical skills through planning and hosting events such as career fair preparatory sessions, student-led internship panels, and soldering workshops. Attended networking events including the IEEE Rising Stars Conference 2018 and 2019 in Las Vegas.Eagle ScoutJanuary 2010 to March 2017To achieve the rank of Eagle Scout I organized and implemented an Emergency Preparedness program within my community to assist in providing aid and relief to those in need in case of a natural disaster. This program worked with members of Fire District 1, FEMA, the Edmonds Emergency Preparedness Association, and Holy Rosary Church in Edmonds, WA.","13":"St. Louis Adventure Group - Assistant OrganizerJanuary 2009 to PresentLead a fine group of adventurers on journeys near and far. Exercise leadership skills with a variety of people.Linux Questions - Online ForumJanuary 2007 to PresentConsult, mentor and experiment with all things Linux.","14":"GDG Silicon Valley MeetupPresent","15":"Alpha Chi Epsilon Chapter of the Phi Theta Kappa Honor SocietyAugust 2017 to Present","16":"Pi Mu Epsilon National Mathematics Honor SocietySeptember 2015 to Present","17":"TensorFlow NorthwestSeptember 2017 to PresentPortland, ORPorland Data Science GroupSeptember 2017 to PresentPortland, ORPortland Python PiratesNovember 2018 to PresentI lead a weekly class on Python programming. In the future we will split into 2 groups with one group focusing on data science and the other on web development and cloud computing.","18":"Student Research Project - MLB Baseball Hall of FameNovember 2016 to March 2017Predictive Models using Discriminant Analysis on the MLB Baseball Hall of Fame\"* Wrote R code for supervised learning model○ Presented at Texas A&M University Student Research Week 2017.","19":"Official Writer of Medium - Toward Data ScienceNovember 2018 to PresentTowards Data Science to provide a platform for people to exchange ideas and to expand our understanding of data science.","20":"of Unity College Wildlife Society ChapterSeptember 2009 to May 2012President","21":"International We Love You FoundationOctober 2013 to PresentThe International WeLoveU Foundation believes that love is the key ingredient that will bring happiness and joy to all lives. Looking beyond nationality, race, religion and socio-economic status, WeLoveU volunteers share “mother’s love” with local and global neighbors through social welfare projects."}}