{"0":{"0":"Service Country: Branch: United States ArmyRank: Lieutenant ColonelCommendations:","1":"Service Country: United StatesBranch: U.S. ArmyRank: SergeantMay 1985 to November 1990•\tServed with the US Army, 2nd Armored Cavalry Regiment and 1st Armored Division for 5 1\/2 years from 1985 to 1990.•\tBasic and Advanced Training: Selected for the “Excellence in Armor” program, resulting in accelerated training and leadership opportunities, 1985.•\tPrimary Leadership Development Course:  Graduated in top 10% of class, 1987Commendations:","2":"Service Country: Branch: United States Air ForceRank: E4Commendations:","3":"Service Country: Branch: United States ArmyRank: SPCCommendations:","4":"Service Country: Branch: United States ArmyRank: SpecialistCommendations:","5":"Service Country: Branch: United States NavyRank: Fire Controlman Second ClassCommendations:","6":"Service Country: United StatesBranch: U.S. Marine CorpsRank: CorporalOctober 2005 to September 2009I served as a Machinist, and Military Policeman stateside as well as a Machine Gunner, Vehicle Commander, and Security Force Commander while deployed.Commendations:Iraqi Campaign MedalOver Sea Service Campaign RibbonNaval Unit Commendation Ribbon (x3)Good Conduct MedalGlobal War on Terrorism Service MedalNational Defense Ribbon","7":"Service Country: United StatesBranch: Infantry (보병)Rank: Private First ClassNovember 1975 to November 1978\tResponsible for the safety and unity of the team.\tMaintained the barracks by learning about plumbing and carpentry\tReceived amphibious and jungle survival training in Panama, arctic training in Alaska, Marine training in Camp Pendleton.Commendations:","8":"Service Country: United StatesBranch: US ArmyRank: E3November 2004 to February 2007Multi-Transmission Systems Technician (25Q)-Network Systems Technician (31F)  • Install operate and perform unit maintenance on line-of-sight multichannel radio terminals, radio access units, COMSEC devices, multiplexing equipment, and antenna systems• Troubleshooting and Analyzing Satellite coordinates and position, positioning Radio Antennas corrected• Transmitting, Receiving, and bridging signal through a Network of units; like Topology ring in an Internet\/Intranet through Remote Access units\/Radio Units, Satellite remote units and Computer Information Systems.• Diagnose electrical circuits in transmitting unit devices, and troubleshoot problems and replace parts. • Install operate supervise and perform unit maintenance on systems control center, node center switch, extension node switches, net radio interface equipment, communications security devices, and RT radios.  • Troubleshooting using digital multimeters, and computer terminals with diagnostic readouts.  Interpret and use operating instructions, database information and system diagrams. Configuring, Repairing, and Installing and Operating Network Systems, TCP\/IP networking components, optic networks and server.Commendations:United States Army\t\t\t\t\t\t               \t\t2004-2006Fort Gordon, GA• MTU Technician, Operator and Maintainer. Radio Communications Technician• Network-Switching Technician. • Networks, Satellite, with Computers.• SMART-T(Mobile Satellite Secure Vehicle)• Mast Antenna","9":"Service Country: United StatesBranch: Army Utah National GuardRank: SergeantOctober 2010 to PresentCommendations:","10":"Service Country: United StatesBranch: ArmyRank: SpecialistJuly 2007 to July 2011Combat MedicCommendations:Army Commendation MedalArmy Achievement MedalGood Conduct Medal2 Overseas Service RibbonsMeritorious Unit Award","11":"Service Country: Branch: United States ArmyRank: LTCJanuary 1984 to December 2010Varied duties in infantry, personnel, postal, logistics, and collective lanes training.Commendations:","12":"Service Country: United StatesBranch: USNRank: E-5May 2007 to April 2018Air Warfare Systems EngineerCommendations:Navy and Marine Core Achievement Medal","13":"Service Country: Branch: United States ArmyRank: SSGCommendations:","14":"Service Country: Branch: United States Air ForceRank: MajorCommendations:","15":"Service Country: United StatesBranch: USMCRank: Lance CorporalApril 1989 to October 1991Commendations:","16":"Service Country: United StatesBranch: Army ReserveRank: Staff SergeantFebruary 2007 to January 2015Commendations:","17":"Service Country: Branch: United States ArmyRank: 2LTCommendations:","18":"Service Country: United StatesBranch: United States ArmyRank: E4July 2007 to July 2013Satellite Communications Operator, Deployment to Afghanistan 2010-2011Commendations:Army Commendation Medal","19":"Service Country: United StatesBranch: NAVYRank: E5January 1972 to January 1977Graduated from USN Advanced Electronics School - RADAR,  April 1973, First in Class.Component level maintenance of surface and air search RADAR, HF, VHF, UHF communications equipment for surface ship and inertial navigation systems for nuclear submarines• AN-SPS 10 surface search RADAR• AN-SPS 40 air search RADAR• AN-SPA 4 & 25 RADAR repeaters (display consoles)• AN-SRC 20\/21 UHF Tranceiver• AN-URC 9 UHF tranceiver• AN-URT 23 HF Transmitter• R-1051 HF receiver• Mk 19, 23, 27 gyroCommendations:National Defense Service MedalGood Conduct Award","20":"Service Country: United StatesBranch: NavyRank: E-4PresentCommendations:","21":"Service Country: Branch: United States ArmyRank: SergeantCommendations:","22":"Service Country: Branch: United States Marine CorpsRank: LCplCommendations:","23":"Service Country: United StatesBranch: USMCRank: E-4October 1974 to September 1978Computer Operator and JCL TechnicianCommendations:Good Conduct Medal Honorable DischargeService Country: Branch: United States Marine CorpsRank: E-4Commendations:Good Conduct Medal Honorable Discharge","24":"Service Country: United StatesBranch: U.S. ArmyRank: SergeantAugust 2004 to June 2009Commendations:Service Country: Branch: United States ArmyRank: SergeantCommendations:","25":"Service Country: United StatesBranch: NavyRank: E2December 1985 to August 1986Ship servicemanCommendations:","26":"Service Country: Branch: United States ArmyRank: Specialist E4Commendations:","27":"Service Country: Branch: United States ArmyRank: PvtCommendations:","28":"Service Country: United StatesBranch: UNITED STATES ARMYRank: SSGSeptember 1985 to January 1995Worked as a Communications Specialist at the Pentagon, Washington, DC.Worked at the Department of the Army in the Communications Center, Arlington, VAWorked at Camp Tango Comunication Center. Seoul, KoreaCommendations:7 Army Achievement Awards3   Army Accomodation Medal  (Third oak Leak Cluster)","29":"Service Country: Branch: United States Marine CorpsRank: SsgtCommendations:","30":"Service Country: United StatesBranch: US ArmyRank: E4Military Police. Honorable DischargeCommendations:","31":"Service Country: Branch: United States Air ForceRank: E-4Commendations:","32":"Service Country: United StatesBranch: United States Marine CorpsRank: CorpralSeptember 2011 to October 2015Infantry Assault-man responsible for mechanical and demolition breaching, infantry movement. I was a section leader.Commendations:Purple Heart, Combat Action Ribbon, Good Conduct Medal, Afghanistan Campaign Medal","33":"Service Country: Branch: United States ArmyRank: Sgt E-5Commendations:","34":"Service Country: United StatesBranch: United States ArmyRank: SpcAugust 2011 to February 2015Commendations:","35":"Service Country: United StatesBranch: US Army ReserveRank: E4February 1999 to February 2007Commendations:","36":"Service Country: United StatesBranch: USMCRank: PrivateDecember 2004 to November 2009Preformed clerical duties such as typing, filing, answering phones, generating various reports and data entry. Preformed small computer maintenance on Nalcomis computer systems to include: Setting up and taking down Hosts computer & Detachment hosts computer, programming said Host & Detachment hosts computers and preforming routine maintenance on Host & Detachment hosts computers.Commendations:","37":"Service Country: United StatesBranch: ArmyRank: SPCMarch 2009 to March 2015Commendations:Service Country: Branch: United States ArmyRank: SPCCommendations:","38":"Service Country: Branch: United States NavyRank: E-5 (Petty Officer Second Class)Commendations:","39":"Service Country: United StatesBranch: United States Navy ReserveRank: SN3May 1997 to May 2005Attended monthly meetings at the navy training site. Participated in physical activities and educational seminars.Commendations:Honorable discharge from the United States Navy Reserve, May 13, 2005.Recommended for reenlistment.","40":"Service Country: United StatesBranch: marines\/navyRank: Pfc Marines- Navy IC3 Pretty officer ( SS)• Marines  during  hi school.      1955-57                                                                                                                                                                                                       Navy                                        1957-1961. IC3 Petty Office SubmarinesCommendations:","41":"Service Country: Branch: United States Marine CorpsRank: E-3Commendations:","42":"Service Country: Branch: United States ArmyRank: E5Commendations:","43":"Service Country: United StatesBranch: USAFRank: E-3April 2011 to August 2016Aircrew Flight Equipment Journeyman- maintain, repair and inspect life saving equipment.Commendations:","44":"Service Country: Branch: United States Air ForceRank: SrACommendations:","45":"Service Country: United StatesBranch: Hawaii Air National GuardRank: Staff SergeantJuly 2010 to PresentCyber Transport Systems TechnicianCommendations:Air Force Achievement Medal x 2","46":"Service Country: United StatesBranch: Marine CorpsRank: Lance CorporalOctober 2016 to January 2019Commendations:","47":"Service Country: United StatesBranch: ArmyRank: E-6 \/ Staff SergeantJuly 1998 to February 2007Commendations:Service Country: Branch: United States ArmyRank: E-6 \/ Staff SergeantCommendations:","48":"Service Country: United StatesBranch: ARMYRank: E-4July 2005 to July 2008Commendations:Service Country: Branch: United States ArmyRank: E-4 Specialist.Commendations:","49":"Service Country: Branch: United States ArmyRank: First SergeantCommendations:","50":"Service Country: United StatesBranch: NavyRank: E5June 2013 to June 2018Commendations:","51":"Service Country: Branch: United States ArmyRank: SSGCommendations:","52":"Service Country: Branch: United States NavyRank: E3Commendations:","53":"Service Country: Branch: United States Air ForceRank: E-3Commendations:","54":"Service Country: Branch: United States Marine CorpsRank: EnlistedCommendations:","55":"Service Country: Branch: United States Marine CorpsRank: CorporalCommendations:","56":"Service Country: United StatesBranch: United States Marine CorpsRank: Lance CorporalMay 2010 to May 2014Cyber Network SpecialistCommendations:","57":"Service Country: United StatesBranch: United States Air ForceRank: Sr AirmenSeptember 1993 to December 2002Aircraft Structural Maintenance:Assembled structural parts and components to meet requirements for preserving structural integrity of military aircraftTrained new techniciansCommendations:","58":"Service Country: United StatesBranch: US NavyRank: Machinest Mate Second Class Petty Officer  (SW)Commendations:Armed Forces ExpeditionaryNavy ExpeditionaryUnit CommendationLetter of Commendation","59":"Service Country: United StatesBranch: United States Marine CorpsRank: E-5\/SergeantSeptember 2010 to September 2015Commendations:","60":"Service Country: Branch: United States Marine CorpsRank: SgtCommendations:","61":"Service Country: United StatesBranch: ArmyRank: SSGAugust 2003 to February 2010I was a 13M Multiple Launch Rocket Systems Crewmember and went onto obtain the position of platoon sergeant.Commendations:I received multiple Army Commendation medals as well as Army Achievement medals.","62":"Service Country: Branch: United States Marine CorpsRank: LcplCommendations:","63":"Service Country: Branch: United States ArmyRank: E-4Commendations:","64":"Service Country: United StatesBranch: USMCRank: E-5November 2012 to November 2016Commendations:","65":"Service Country: Branch: United States NavyRank: E6Commendations:","66":"Service Country: United StatesBranch: US ArmyRank: Sergeant First Class (SFC)January 1996 to September 2016Commendations:","67":"Service Country: United StatesBranch: U.S. ArmyRank: E-5 SergeantMarch 1993 to March 199897E - Interrogator, Syrian Arabic dialect1 tour in support of Counterintelligence operations in Saudi Arabia (1996)Maintained native fluency in target languageCommendations:Army Achievement Medal","68":"Service Country: Branch: United States ArmyRank: E-4Commendations:","69":"Service Country: United StatesBranch: Air ForceRank: SSgtJune 2004 to October 2018Commendations:Air Force Achievement MedalArmy Achievement MedalAir Force Joint Serice Achievement medalAir Force Commendation MedalSenior Airman Below the Zone (Early Promote)","70":"Service Country: United StatesBranch: United States Air ForceRank: Senior AirmanJuly 2006 to January 2014AFSC 3D1X2, Cyber Transport SystemsCommendations:Air Force Achievement Medal, Iraq Campaign Medal, Meritorious Unit Award","71":"Service Country: Branch: United States NavyRank: E-7Commendations:","72":"Service Country: Branch: United States Marine CorpsRank: E-5Commendations:","73":"Service Country: United StatesBranch: Air forceRank: E4January 1983 to June 1989Commendations:","74":"Service Country: United StatesBranch: NavyRank: E3Sonar techCommendations:Navy expeditionary Humanitarian","75":"Service Country: United StatesBranch: United States Air ForceRank: E-6March 1996 to March 2006Computer Systems Operations, 3c07Commendations:Joint ServiceService Country: Branch: United States Air ForceRank: E-6Commendations:Joint Service","76":"Service Country: United StatesBranch: US Marine CorpsRank: Sergeant E-5August 1985 to March 1993Aviation Maintenance Administration Technical Logs and RecordsCommendations:Southwest Asia Service Medal Kuwaiti Liberation MedalGood Conduct Medal w\/StarMeritorious Unit Citation ","77":"Service Country: United StatesBranch: Marine CorpsRank: CorporalApril 2015 to PresentCommendations:","78":"Service Country: United StatesBranch: Army National GuardRank: Private First ClassMay 2016 to Present25B (IT and Network Specialist) in the Army National Guard soon to be Specialist.Commendations:","79":"Service Country: United StatesBranch: ArmyRank: SSGpJuly 2005 to August 2017Commendations:","80":"Service Country: United StatesBranch: United States ArmyRank: E4April 1999 to May 2006Commendations:Army Commendation Medal; Army Achievement Medal; US Army Presidential Unit Citation; Army Good Conduct Medal; National Defense Service Medal; Global War on Terrorism Service Medal; Army Service Ribbon; Iraq Campaign Medal","81":"Service Country: United StatesBranch: U.S. Marine CorpsRank: CorporalFebruary 2016 to PresentCommendations:","82":"Service Country: Branch: United States ArmyRank: E-4 SpecialistCommendations:","83":"Service Country: Branch: United States Marine CorpsRank: Lance CorporalCommendations:","84":"Service Country: United StatesBranch: United States Marine CorpsRank: CorporalMay 2012 to PresentCommendations:Certificate of Commendation","85":"Service Country: United StatesBranch: United States Marine CorpsRank: CorporalJanuary 2015 to PresentI am currently serving in the United States Marine Corps. I will be getting out of the military Dec 29th 2018.Commendations:I have received two letter of appreciation for volunteering. The first was a adopt a mile program where I was hand selected to lead 17 marines. The second was volunteering at a Okinawan elementary school teaching the children there.","86":"Service Country: United StatesBranch: Indiana Army National GuardRank: E4Commendations:","87":"Service Country: United StatesBranch: ArmyRank: SpecialistAugust 1985 to August 1989MOS 74F Programmer\/Analyst.  I served two tours.  One in West Germany, and one at the Pentagon.  In Germany, I was stationed at a tactical data processing facility (25th AG DPU-CTASC), processing personnel and assignment data (SIDPERS, TAPERS, CAPIII) for all of USAREUR.  At the Pentagon (USAISC-P\/USAMSSA), I worked on the President's Budget System (PBS).Commendations:AIT, OSR, GCM, AAM","88":"Service Country: United StatesBranch: United States Marine CorpsRank: Private First ClassJanuary 2018 to PresentCommendations:","89":"Service Country: United StatesBranch: United States ArmyRank: E-4July 1998 to July 2006MOS - 13F (Fire Support Specialist) Forward observer. Stationed with a Field Artillery BDE HHB unit, where we conducted fire missions via IFSAS\/AFATDS systems combined with radar units to our FA battalions.  Performed multiple exercises, included Warfighter (stateside and overseas), as well as many others.Active Duty service ended July 2002.  Enlisted into Army Reserves in November 2002 and performed in G-6 section of an RSC unit supporting a four-state region of US Army Reserve units with IT needs, for both stateside and foreign deployments.Commendations:ARCOM,AAM(3),NDS,others.","90":"Service Country: Branch: United States Marine CorpsRank: E-5Commendations:","91":"Service Country: Branch: United States Marine CorpsRank: SergeantCommendations:","92":"Service Country: United StatesBranch: UNITED STATES MARINE CORPSRank: E-5December 1993 to December 1998Commendations:","93":"Service Country: United StatesBranch: US ArmyRank: SpecialistOctober 2014 to PresentInformation Technology SpecialistCommendations:Service Country: Branch: United States ArmyRank: SpecialistCommendations:","94":"Service Country: Branch: United States ArmyRank: SGTCommendations:","95":"Service Country: United StatesBranch: ArmyRank: E4January 2002 to PresentCommendations:","96":"Service Country: Branch: United States Marine CorpsRank: CplCommendations:","97":"Service Country: Branch: United States NavyRank: E-5Commendations:","98":"Service Country: United StatesBranch: ArmyRank: E4October 2000 to October 2005Commendations:","99":"Service Country: United StatesBranch: ArmyRank: CaptainMay 2004 to August 2011Commendations:Bronze star medal2xARCOM4xAAM","100":"Service Country: United StatesBranch: USMCRank: CPLJanuary 1989 to January 1993Completed 2 tours in Iraq with the Marines and one with the Army National GuardCommendations:","101":"Service Country: United StatesBranch: United States Marine CorpsRank: E-4 CorporalJuly 1983 to August 1987MOS 6123 ADJ Aircraft Jet Engine MechanicCommendations:","102":"Service Country: United StatesBranch: U.S ArmyRank: E-5June 2008 to October 2012Sergeant, Infantry•\tSquad leader of a light infantry company o\tDeveloped leadership skills of other soldierso\tResponsible for the welfare, fitness, morale, and discipline of Soldiers in squado\tAccountable for the individual training and maintenance of soldiers’ equipmento\tResponsible for the accountability and maintenance of equipment worth in excess of $750,000•\tPrimary instructor and advisor in the matters of tactics, and personnel management in unito\tChemical-Biological-Radiological-Nuclear subject matter experto\tCompany Intelligence Support Team Non-Commissioned Officero\tAdvised commanders on weather, terrain, enemy, and local population on friendly operations and aid in decision making o\tSupervised set-up, break-down and use of all electronic equipmentCommendations:","103":"Service Country: Branch: United States NavyRank: E6Commendations:","104":"Service Country: United StatesBranch: ArmyRank: SPCJanuary 2008 to February 2016Served as a 25B and a 25QCommendations:Service Country: Branch: United States ArmyRank: SPCCommendations:","105":"Service Country: Branch: United States ArmyRank: Sergeant (E-5)Commendations:","106":"Service Country: United StatesBranch: US NavyRank: E-7May 1986 to October 2002Commendations:Service Country: Branch: United States NavyRank: E-7Commendations:","107":"Service Country: Branch: United States ArmyRank: Staff Sargent (E6)July 1999 to November 201114S Air Defense - Staff Sargent           ·      Maintain and operate early warning network (cisco devices) for incoming fire·      Managing personnel·      Training personnel ·      Ensure readiness of personnel and equipment95B Military Police - Sargent·      Maintain law and order (garrison)·      Manage personnel·      Training personnel·      Ensure readiness of personnel and equipment19K Armor Crewman - Sargent·      Operate M1A1 Abrams tank·      Mange personnel ·      Training Personnel·      Ensuring Readiness of personnel and equipment·      Responsible for 1.7 million dollars’ worth of equipmentCommendations:Army Commendation Medal, Army Achievement Medal (2nd award), National Defense Service Medal, Global War On Terrorism Service Medal, Iraqi Campaign Medal with Campaign Star, Army Service Ribbon, Overseas Service Ribbon (2nd award), Armed Forces Reserve Medal with M device","108":"Service Country: United StatesBranch: Air ForceRank: E-5January 2005 to January 2010Commendations:","109":"Service Country: Branch: United States ArmyRank: SGT\/E-5Commendations:","110":"Service Country: United StatesBranch: ArmyRank: SPC (P)October 2001 to January 2005Commendations:Army Achievment medal, Global War on Terrorism medal, ","111":"Service Country: Branch: United States National GuardRank: Technical SergentCommendations:","112":"Service Country: United StatesBranch: ArmyRank: Sgt\/E-5August 2010 to October 201425U\/Signal Support Systems Specialist. By job description, I was responsible for ensuring reliable radio communications via various communication devices. I was also in charge of ensuring vehicles could effectively communicate using battlefield radio systems. During my time in the Army, I received several awards for my outstanding achievements. I taught many classes with 0% fail rate. Supported many vehicles, and designed and implemented new and improved methods of communications for those vehicles.Commendations:I was awarded 4 Army Achievement medals (AAM) for my work in teaching other soldiers effective radio operations, especially in a combat zone, as well as my work in designing new methods of effective communication within the vehicles. I was also awarded an AAM for setting a new standard on proper cable management for networking cables on vehicles and other types of devices such as our battlefield \"Stacks\"; a set of battlefield switches and routers. ","113":"Service Country: Branch: United States Air ForceRank: Senior AirmanCommendations:","114":"Service Country: Branch: United States Marine CorpsRank: SergeantCommendations:","115":"Service Country: Branch: United States NavyRank: E-6Commendations:","116":"Service Country: United StatesBranch: Air ForceRank: MSgtMarch 1983 to December 2001Commendations:","117":"Service Country: Branch: United States Marine CorpsRank: E-2Commendations:","118":"Service Country: Branch: United States ArmyRank: SGTCommendations:","119":"Service Country: United StatesBranch: NavyRank: E-5June 1999 to October 2008Petty Officer Second Class (AW) Aviation Structural Mechanic – Safety Equipment    United States Navy, San Diego CA, Norfolk, VA, Roosevelt Roads, Puerto Rico                            ·        Completed four expeditionary deployments in support of Operations Enduring Freedom and Operation Iraqi Freedom.  Aviation Life Support Systems (ALSS) Work Center 13B Supervisor (2004 - 2008) ·        Managed, trained and mentored  23 junior sailors junior technicians in the performance of maintenance and logistic support to Carrier Air Wing and Carrier Strike Groups during four forward operations theater deployments with Fleet Logistics Support Squadron 30 (VRC-30).      ·        Led technically diverse forward deployed detachment documenting 6,700 maintenance man-hours. Directed the completion of 4 aircraft maintenance production program quality assurance audits. ·        Performed Quality Assurance inspections of Life Support, Explosive, and Utility systems on 16 E2C and C2A aircraft.  Environmental Systems and Airframes Technician    (1999 - 2008) ·        Tasked with maintaining the various aircraft systems such as seat and canopy ejection, gaseous and liquid oxygen, life raft ejection, fire extinguishing, air conditioning, cabin and cockpit heat, pressurization and ventilation. Responsible for removing and installing oxygen system valves, gauges, converters and regulators, and inspecting, removing, installing and rigging ejection seats, shoulder harnesses, lap belts and face-curtain mechanisms. Performance of daily, preflight, post flight and other periodic aircraft inspections.·        Fabricated and assembled metal components and made minor repairs to aircraft skin and seat assemblies. Installed rivets and metal fasteners, painted, welded. Fabricated repairs for composite components using fiberglass, carbon fiber, and other insulating composites as required. Commendations:Service Awards Earned:·        Navy and Marine Corps Achievement Medal – Life Saving Actions·        Humanitarian Service Medal – Operations in Southeast Asia 2004 Tsunami Relief ·        Global War on Terrorism Expeditionary Medal – Support of Iraq and Afghanistan Conflicts·        Enlisted Aviation Warfare Specialist (AW)·        COMNAVAIRFORCES Safety Award - Aircraft Firefighting and Explosives Disarming","120":"Service Country: United StatesBranch: Air ForceRank: Senior AirmanDecember 2014 to PresentCommendations:","121":"Service Country: South KoreaBranch: Combined Forces Command \/ United States Forces KoreaRank: SergeantNovember 2016 to August 2018• Military Interpreter and Intelligence Analyst for the joint ROK-US intelligence situation room for the highest joint ROK-US military installation in the country. • Translated key confidential intelligence reports from both US and ROK intelligence agencies• Reported to both US and ROK intelligence officers about latent threats caught from the security systems • Interpreted video conferences between the ROK and US Joint Chiefs of Staffs, Defense Intelligence Agency along with other high-ranking ROK intelligence agencies.Commendations:","122":"Service Country: TaiwanBranch: Messenger of Major General CommanderRank: First classNovember 2016 to November 2017Commendations:","123":"Service Country: United StatesBranch: Air ForceRank: MajMay 1983 to September 1998Logistics Officer serving at base, depot, and headquarters level. Served during Desert Storm.Commendations:See resume for awards, achievements, and decorations.","124":"Service Country: Branch: United States Marine CorpsRank: E-5Commendations:"}}