{"0":{"0":"Google Developer Challenge Scholarship2018-01Learned to maneuver around Android Studio to create novice apps using Java and Extensive Mark Up Language (XML)","1":"9th National Science Olympiad SOF2007-01Distinctive rank in state and national level in 9th National Science Olympiad Science Olympiad Foundation","2":"Employee of the Year - Event Farm (2014)2015-01","3":"95th Percentile in Major Field Test in Business2009-06The Major Field Test is an all-encompassing examination that tests four years of undergraduate over a broad range of core curriculum subjects.Omicron Delta Epsilon Honor Society for Economics2009-06Achieved a greater than 3.0 GPA in Economics core curriculum, earning membership in an academic honor society.","4":"Georgia Institute of Technology Dean's ListReceived award for all 7 semesters I studied at Georgia Tech (Fall 2013 - Fall 2016)Georgia Institute of Technology Towers AwardAwarded to minority students with a GPA of 3.15 or higher. Received award each year I studied at Georgia Tech (2014 - 2016)","5":"Phi Theta Kappa - Alpha Upsilon2001-05Honors and AwardsWNCCNational Academic Honor Society","6":"SJSU President’s Scholar, College of Engineering, Aerospace Engineering, Featured Student2012SJSU College of Engineering Commencement Address Speaker2012SJSU Aerospace Engineering Graduate of the Year Award2012SJSU Aerospace Engineering Outstanding Leadership Award2012SJSU Aerospace Engineering Exemplary Service Award2012","7":"“Achiever of the Month” in all quarters for quick and defect free delivery.","8":"Certificate of AppreciationReceived 11 times while working for McDonnell Douglas which became Boeing.","9":"IEEE - Lokmanya Tilak College of Engineering, University of Mumbai, Member 10\/2011 - 10\/2013Organized several technical events including Microsoft Dream Spark Yatra and Nokia Student Developer ConclavePace University Fall 2018 Hackathon2018-11Won Pace University AI Club Fall 2018 Hackathon","10":"Top producer2005-12Top account executiveTop producer2006-12Top account executive and team leaderNFS-STEM scholarship2011-01I received this from 2011-2014","11":"Bronze Medal - EPA2010-10Bronze Medal Awarded for Exceptional Service.","12":"National Merit Scholarship Finalist2011","13":"Top Performer2005-01Among 2% top performers, CEO of Infosys gifts iPhone 6 as a token of appreciation Devon Value Award2016-10Multiple Devon Value Award for commitment towards workEntrepreneur Award2017-10Entrepreneur Award by Devon for learning and inspiring employees to learn Machine LearningInsta Award2015-03Insta Award by Infosys for developing the most critical module of the project with minimal defects","14":"Thomas J. Watson Memorial Scholarship1982-02was a National Merit Finalist and won a four-year college scholarship from IBM Corp.","15":"CHEERs Award2016-05Award given for saving critical project","16":"Innovative Software Engineer with experience in complex data analysis and web-based application design. Develop code and product lifecycles per clients' unique specifications. Adept at working on concurrent projects in fast-paced, collaborative environments; recognized for resolving technical issues efficiently and professionally. Proficient in English and Hindi. Fully authorized to work in the United States without sponsorship. Experience includesEarned Spot Award and Outstanding Performer & Team Player for project contributionsReceived Client Recognition Award from satisfied client post-projectEarned Spot Award due to strong work ethic and meeting project deadlinesAwarded Champs Team Trophy in December 2011 due to project quality","17":"President's List1999-10Director's Award1999-11Special Recognition Award2000-04Honor's Award2010-01","18":"College of Engineering Dean’s Honors List2019-01Maintained an average GPA above 3.5 every year with 10 hours of community service","19":"Award of Appreciation2012-11Five years of service.","20":"North Atlantic Treaty Organization (NATO)2014-10Good Conduct Medal (GCM)2015-08","21":"Officer of the Month2014-07In honor of exemplifying Whelan's core value of RESULTS","22":"Officer of the Month2014-07In honor of exemplifying Whelan's core value of RESULTS","23":"Deans List2014-03","24":"Summa Cum Lausw2009-05Graduated Summa Cum Laude with a 3.9 GPA","25":"National Technical Honor Society2010Highest Honors (4.0 GPA)IKON Office Solutions - Presidents Club2002Special recognition for outstanding achievement.Presidents Club Award for top performance2010-10Top performer over all teams.","26":"Nominated to the All-USA Community College Academic Team2015-03Recognition of scholarly achievements and leadership accomplishments.","27":"THE ARMY ACHIEVEMENT MEDAL2011-11AWARDED FOR EXCEPTIONAL ACHIEVEMENT WHILE ASSIGNED TO STB, 2HBCT, 1AD, AS A NETWORK ENGINEER. SPC AGEE's DRIVE FOR EXCELLENCE AND DEDICATION DIRECTLY CONTRIBUTED TO THE SUCCESS OF THE BRIGADE'S NETWORK INTEGRATION EVALUATION (NIE) 12.1 MISSION. SPC AGEE'S DEDICATION TO EXCELLENCE REFLECT GREAT CREDIT UPON HIMSELF, THE SPECIAL TROOPS BATTALION, THE 2D HEAVY BRIGADE COMBAT TEAM, 1ST ARMORED DIVISION, AND THE UNITED STATES ARMY.","28":"Aindra Rockstar2016-08Received spot award from the company after they recognized my consistent hard work and meeting deadlines and winning customers after showcasing demos successfully to customers.","29":"Appointed scientific reviewer2006-06Appointed scientific reviewer by the General Secretariat for Research and Technology, Hellas (GSRT-ΓΓΕΤ program ENTER, Athens, Greece)Training for Mobility of Researchers (TMR) Marie Curie fellowship1999-09Was offered the Training for Mobility of Researchers (TMR) Marie Curie fellowship by the University of Alicante, SpainOSU Physics Dep Summer Academic Fellowship, Research\/Teaching Assistantships1996-06CSU Fresno Alumni Association Academic Scholarship for outstanding scholarly accomplishment1989-06California State University Fresno Alumni Association Academic Scholarship for outstanding scholarly accomplishment; GPA 4.0, Dean’s List, CSUF","30":"Gerald Loeb Finalist2013","31":"Cornell University Dean's List","32":"Dean's Excellence Scholarship Award2018-06Awarded a Scholarship of 1000 USD for the Fall, Spring and Summer semesters' period of my first year at UT Dallas.P.C. Mahalanobis Scholarship Award2018-01Awarded the P.C. Mahalanobis award of 45,000 INR for outstanding performance in a data analytics hackathon organised by International School of Engineering","33":"Meritorious Winner 2017 Modeling Contest in Mathematics2017-04Waiting in Airport Security Checkpoint: A Perspective from Queueing Theory – 2017 MCM▪ Led the group to conduct empirical analysis using R to establish a mathematical model for increasing checkpoint throughput and reducing variance in wait time, proposed and implemented a feasible method to estimate passenger volume at various times ▪ Developed two modifications to the current procedural model, with the first one incorporating a Bifurcation System and the second designing a Circular Line-up System ","34":"RIATA Rising Star award2017-11Received $250 cash prize and RIATA Rising Star award for developing PTSD diagnosing model using Machine Learning","35":"Merit-based scholarship recipient 2017Honor: Dean's List (2013)Language: Mandarin, EnglishTravel, Sports, hiking","36":"Touchdown career business analytic bootcamp first prize award2018-08","37":"Eagle Scout, Boy Scouts of America1990-01","38":"Academic Excellence Award2009-01","39":"1st in Student Research Project2015-12The Health Alert App for Wearable Device led the 1st in Student Research Project Contest among 22 teams, FJU.","40":"HonorsGraduated with High Honors, The Cornerstone School, Manchester CT (2008)Graduated with Honors, Unity College, Unity ME (2012)","41":"Air Force Tactical Air Command Outstanding Open Mess Manager of the Year1988-06Selected as the outstanding manager of an officers' open mess in Tactical Air Command for outstanding sales and profits in a highly competitive area of Las Vegas, NV. Provided outstanding service and quality and unique programs to attract sales.","42":"Millard E. Tydings Memorial Prize for Excellence in Public Speaking2017-05Ariel Internship Award in Education2015-05Grant awarded to fund research or work in the Education field","43":"National Scholarship2014-11(Top 2%) from Ministry of Education of ChinaJing Shuping Scholarship2015-11(Top 3%)from Xi’an Jiaotong UniversityJing Shuping Scholarship2016-11(Top 3%)from Xi’an Jiaotong UniversityExcellent Student Leader Award as Minister of Academic Dept., XJTU Economic Society2015-11","44":"Dean's Honor List2018-08Recognition by USC Marshall School of Business for an outstanding academic performance.","45":"Michael E. Dubyak Scholarship2016-03In recognition of academic success, I was chosen by a faculty committee to receive the Michael E. Dubyak Scholarship."}}