{"0":{"0":"Ordnance Officer Advanced Program of Instruction.The 400 page manuel used by experienced US Logistics Officers attending the Officer Advanced Course and produced by the Government Printing Office.","1":"Forecasting House Prices Using a DCSVR Modelhttps:\/\/www.crcpress.com\/Applied-System-Innovation-Proceedings-of-the-2015-International-Conference\/Meen-Prior-Lam\/p\/book\/97811380289372015-05This thesis reports forecasting house prices by using a district classification support vector regression (DCSVR) model. In general, house prices have nonlinear and clustering properties. Thus, in this study, a support vector regression (SVR) model was used to perform district classification and the results are presented in this thesis. We executed the following procedures: First, the house data were classified according to the district in which the house was located. Second, the classifications conducted in the first stage were used to establish the SVR model, which was used to reduce the complexity of the problem. The proposed model is highly nonlinear and complex. Thus we present an iterative algorithm based on a genetic algorithm for optimizing the parameters of the DCSVR model.","2":"Low Cost Flight-Test Platform to Demonstrate Flight Dynamics Concepts using Frequency-Domain System Identification Methods2013-08Paul M. Woodrow, Mark B. Tischler, Steven G. Hagerott, Gonzalo E. Mendoza, Jeanine M. HunterAIAA Atmospheric Flight Mechanics Conference, August 2013Student-Led Active Learning Workshops: Increasing Student Retention, Decreasing Time to Graduation and Providing High- Performing Students with Opportunities to Develop Coaching Skills2012-10Nikos J. Mourtos, Paul M. WoodrowWorld Engineering Education Forum, October 2012","3":"Nanoscale subsurface- and material-specific identification of single nanoparticleshttps:\/\/doi.org\/10.1364\/OE.19.0208652011-10We report on high resolution subsurface and material specific differentiation of silica, Au and silica-capped Au nanoparticles using scattering-type scanning near-field optical microscopy (s-SNOM) in the visible (λ=633 nm) and mid-infrared (λ=10.7 μm) frequencies. Strong optical contrast is observed in the visible wavelength, mainly because of the dipolar plasmon resonance of the embedded Au nanoparticles which is absent in the infrared. We show that the use of small tapping amplitude improves the apparent image contrast in nanoparticles by causing increased tip-particle and reduced tip-substrate interactions. Experimental results are in excellent agreement with extended dipole model calculations modified to include the capping layer characterized by its refractive index.Near-field infrared nanoscopy of phonon resonant silica and silica-coated gold nanoparticleshttps:\/\/briefs.techconnect.org\/wp-content\/volumes\/Nanotech2011v1\/pdf\/1121.pdf2011-06Single silica capped and uncapped gold nanoparticles are imaged using apertureless near-field optical microscopy (ANSOM) in the visible (λ=632 nm) and infrared frequencies (λ=10.7 µm). Identification of capped and uncapped particles with nanoscale spatial resolution is demonstrated at both in the visible and infrared frequencies. It is shown that the optical contrast depends strongly on the vertical composition of the sample. Experimental evidence is provided that the near-field probing depths improves with increasing tapping amplitude of the probing tip. Previous works have shown that ANSOM can image structures beneath surfaces. The work here demonstrates for the first time that by using nanoparticles as small as 30 nm in diameter that ANSOM can not only distinquish between bare silica and silica capped-gold core nanoparticles, it can also image the polarization states of the metal core nanoparticle below the silica capping layer. Experimental results are in very good agreement with dielectric function model calculations which includes vertical composition of the nanoparticles in the extended dipole approximation. From these calculations the thickness of the capping layer is determined.Nanoscale near-field infrared spectroscopic imaging of silica- shell\/ gold-core and pure silica nanoparticleshttps:\/\/link.springer.com\/article\/10.1007\/s11051-012-0766-z2012-02Spectroscopic near-field imaging of single silica-shell\/Au-core and pure silica nanoparticles deposited on a silicon substrate is performed in the infrared wavelength range (λ = 9–11 μm) using scattering-type scanning near-field optical microscopy (s-SNOM). By tuning the wavelength of the incident light, we have acquired information on the spectral phonon–polariton resonant near-field interactions of the silica-shell\/Au-core and pure silica nanoparticles with the probing tip. We made use of the enhanced near-field coupling between the high index Au-core and the probing tip to achieve spectral near-field contrast of the thin silica coating (thickness < 10 nm). Our results show that spectroscopic imaging of thin coating layers and complex core–shell nanoparticles can be directly performed by s-SNOM.","4":"Container Code Recognition: Surveyhttp:\/\/www.academicscience.co.in\/admin\/resources\/project\/paper\/f201503051425543154.pdf2015-03Gujarati Character Recognition: Surveyhttp:\/\/www.academicscience.co.in\/admin\/resources\/project\/paper\/f201503031425427640.pdf2015-03","5":"Data Encryption for DB2 and IMS Databases – new solutions for DB2http:\/\/www-01.ibm.com\/support\/docview.wss?uid=swg21586761&aid=12012-02Infosphere Guardium Data Encryption has been enhanced with two additional encryption methods for DB2 databases: • APAR PM55879 introduces a customizable FIELDPROC and updates the ISPF interface that builds DB2 data encryption implementation JCL • APAR PM45364 introduces a customizable User Defined Function (UDF) less","6":"TEACHER’S ASSISTANT- AUTOMATIC QUESTION PAPER GENERATORhttp:\/\/www.ijarcs.info\/index.php\/Ijarcs\/article\/view\/31212017-04Examination process is an important activity for educational institutions to assess student performance. However, preparing the exam questions is very challenging, tedious and time consuming for the instructors. Generating an effective question paper is a task of great importance for any educational institute. The traditional method, where lecturers manually prepare the question paper, is very tedious and challenging. The aim is to automate the entire process of question paper generation and correction using the PC. Hence, with the help of this project we present the solution in form of “Teacher's Assistant” (TAS). This system includes several modules like user administration, subject selection, difficulty level specification, question entry, paper generation, answer checker and paper management. Thus the system optimizes the human effort involved and also reduces the overall time consumed in the process of generating question papers.","7":"Fast Image Method for Impulse Response Calculations of Boxed-Shaped Roomshttps:\/\/doi.org\/10.1016\/j.apacoust.2008.02.0032009-01Applied Acoustics,Elsevier publishingAbstract:The image method has been used for calculating the impulse response of box-shaped rooms for over 25 years. While this method is functional, it can be inefficient because many of the commonly used mathematical operations are either redundant or unnecessary. This paper addresses these two inefficiencies by proposing both the use of look-up tables to prevent redundant calculations, and the use of a sorting method to allow the prevention of unnecessary calculations. Either technique, by itself, results in a large reduction in computation time. The greatest time reductions, however, can be achieved when both techniques are used together.Rhythm-Synchronized Effects Control with Modulation Keying and Bézier Splineshttp:\/\/dafx09.como.polimi.it\/proceedings\/papers\/paper_10.pdf2009-0912th International Conference on Digital Audio Effects,Politecnico di Milano, Como, ItalyAbstract:This paper discusses details related to the automatic control of effects parameters. Specifically, it examines control of audio effects when synchronized with a musical piece’s rhythm. Synchronization is achieved by having control data that is periodic with the bar-length. The need for continuity in the control data is also discussed. This concept is introduced in terms of modulation techniques known as ASK and CPFSK. This is expanded upon with a discussion of a curve drawing technique that is common to computer graphics.The Image-Source Reverberation Model in an N-Dimensional Spacehttp:\/\/recherche.ircam.fr\/pub\/dafx11\/Papers\/17_e.pdf2011-0914th International Conference on Digital Audio Effects,Institut de Recherche et Coordination Acoustique\/Musique (IRCAM), Paris, FranceAbstract:The image method is generalized to geometries with an arbitrary number of spatial dimensions. n-dimensional (n-D) acoustics is discussed, and an algorithm for n-D room impulse response calculations is presented. Synthesized room impulse responses (RIRs) from n-D rooms are presented. RIR characteristics are discussed, and computational considerations are examined.Reverberation Modeled as a Random Ensemble of Imageshttp:\/\/www.aes.org\/e-lib\/browse.cfm?elib=197982018-10145th Audio Engineering Society Convention,New York, New York, USA,Abstract:Modeling box-shaped rooms with the image method requires many mathematical operations. The resulting reverberation effect is qualitatively flawed due to sweeping echoes and flutter. Efficiency is improved with the Fast Image Method, and sweeping echoes can be suppressed by using randomization. With both approaches, however, there is still a remaining problem with flutter. To address all of these issues, the Fast Image Method is modified to have both randomized image locations and increased symmetry. Additional optimizations are proposed and applied to the algorithm. The resulting audio effect has improved quality, and the computation time is dramatically reduced (by a factor usually exceeding 200) when compared to its ancestral Allen and Berkley algorithm. Some relevant perceptual considerations are also discussed. ","8":"Parallel Programming Paradigms for Reliability - based Design Optimization with Discrete Design Variableshttp:\/\/pc01.lib.ntust.edu.tw\/ETD-db\/ETD-search-c\/view_etd?URN=etd-0720112-1333532012-08Master's ThesisMining Association Rules in a Bridge Deterioration Databasehttp:\/\/www.ctresources.info\/ccp\/paper.html?id=50182008-09Undergraduate ResearchEstimating Bridge Performance Using Time Series Analysishttp:\/\/www.ctresources.info\/ccp\/paper.html?id=50192008-09Undergraduate Research","9":".NET Common Language Runtime2001-04Features of CLR explained and shown how to use.","10":"Overview of Virtual Prototyping Techniques for  System Development and Validationhttps:\/\/www.onlinejournal.in\/IJIRV3I4\/370.pdf2017-06","11":"Cross platform (RDBMS to NoSQL) database validation tool using bloom filterhttps:\/\/ieeexplore.ieee.org\/document\/75695372016-04A platform to validate huge datasets during migration from NoSQL to RDBMS databases and pinpoint the exact corrupted records in constant space and linear time complexity up to a desired error probability.","12":"The Influence of Community Interactions on User Affinity in Social Networks: A Facebook Case Studyhttps:\/\/ieeexplore.ieee.org\/document\/8550063\/metrics#metrics2018-10A Weighted Network Analysis of User Migrations in a Social Network2018-09Published in International Conference on Advances in ICT for Emerging Regions ICTer2018","13":"Performance Analysis of Baseband Modulation Techniques for Visible Light Communicationhttps:\/\/pdfs.semanticscholar.org\/cb64\/53d1faf6ed8c898ea4ff8ab4b4aa44a1374e.pdfUnfolding the Potential of IBeaconhttp:\/\/www.iraj.in\/journal\/journal_file\/journal_pdf\/12-135-143142490572-76.pdf","14":"On the Design and Implementation of Wireless Multimedia Sensor Networkshttp:\/\/airccse.org\/journal\/ijngn\/papers\/0910ijngn03.pdf2010-09In my summer internship, I was able to work on a wireless sensor network that would monitor a specific area of land and be able to send that raw data wirelessly to a computer or database for further processing and analysis. In my paper are the steps that were taken to work on the project I was conducting.","15":"The Topology of Large Scale Structure in the 1.2Jy IRAS Redshift Survey (Protogeros, Z.A.M. & Weinberg, D.H. 1997, ApJ, 489, 457)http:\/\/iopscience.iop.org\/0004-637X\/489\/2\/4571997-11We measure the topology (genus) of isodensity contour surfaces in volume-limited subsets of the 1.2 Jy IRAS redshift survey, for smoothing scales λ = 4, 7, and 12 h-1 Mpc. At 12 h-1 Mpc, the observed genus curve has a symmetric form similar to that predicted for a Gaussian random field. At the shorter smoothing lengths, the observed genus curve shows a modest shift in the direction of an isolated cluster or \"meatball\" topology. We use mock catalogs drawn from cosmological N-body simulations to investigate the systematic biases that affect topology measurements in samples of this size and to determine the full covariance matrix of the expected random errors. We incorporate the error correlations into our evaluations of theoretical models, obtaining both frequentist assessments of absolute goodness of fit and Bayesian assessments of models' relative likelihoods. We compare the observed topology of the 1.2 Jy survey to the predictions of dynamically evolved, unbiased, gravitational instability models that have Gaussian initial conditions. The model with an n = -1 power-law initial power spectrum achieves the best overall agreement with the data, though models with a low-density cold dark matter power spectrum and an n = 0 power-law spectrum are also consistent. The observed topology is inconsistent with an initially Gaussian model that has n = -2, and it is strongly inconsistent with a Voronoi foam model, which has a non-Gaussian, bubble topology.Local Lagrangian Approximations for the Evolution of the Density Distribution Function in Large-Scale Structure (Protogeros, Z.A.M. & Scherrer, R.J. 1997, MNRAS, 284, 425)http:\/\/adsabs.harvard.edu\/abs\/1997MNRAS.284..425P1997-01We examine local Lagrangian approximations for the gravitational evolution of the density distribution function. In these approximations, the final density at a Lagrangian point q at a time t is taken to be a function only of t and the initial density at the same Lagrangian point. A general expression is given for the evolved density distribution function for such approximations, and we show that the vertex generating function for a local Lagrangian mapping applied to an initially Gaussian density field bears a simple relation to the mapping itself. Using this result, we design a local Lagrangian mapping which reproduces nearly exactly the hierarchical amplitudes given by perturbation theory for gravitational evolution. When extended to smoothed density fields and applied to Gaussian initial conditions, this mapping produces a final density distribution function in excellent agreement with full numerical simulations of gravitational clustering. We also examine the application of these local Lagrangian approximations to non-Gaussian initial conditions.Skewness of the Large-Scale Velocity Divergence from Non-Gaussian Initial Conditions (Protogeros, Z.A.M. & Scherrer, R.J. 1997, MNRAS, 286, 223)http:\/\/adsabs.harvard.edu\/abs\/1997MNRAS.286..223P1997-03We compute the skewness t_3 and the corresponding hierarchical amplitude T_3 of the divergence of the velocity field for arbitrary non-Gaussian initial conditions. We find that T_3 qualitatively resembles the corresponding hierarchical amplitude for the density field, S_3, in that it contains a term proportional to the initial skewness, which decays inversely as the linear growth factor, plus a constant term which differs from the corresponding Gaussian term by a complex function of the initial three- and four-point functions. We extend the results for S_3 and T_3 with non-Gaussian initial conditions to evolved fields smoothed with a spherical top-hat window function. We show that certain linear combinations, namely S_3+½T_3, S_3+T_3 and s_3+t_3, lead to expressions which are much simpler, for non-Gaussian initial conditions, than S_3 and T_3 (or s_3 and t_3) considered separately.Testing Tree-Level Perturbation Theory for Large Scale Structure with the Local Lagrangian Approximation (Protogeros, Z.A.M., Melott, A.L., Scherrer, R. J.  1997, MNRAS, 290, 2, 367)http:\/\/adsabs.harvard.edu\/abs\/1997MNRAS.290..367P1997-09We test tree-level perturbation theory for Gaussian initial conditions with power spectra P(k)~k^n by comparing the probability distribution function (PDF) for the density predicted by the local Lagrangian approximation (LLA) with the results of numerical gravitational clustering simulations. Our results indicate that our approximation correctly reproduces the evolved density PDF for n=-1 and -2 power spectra up to the weakly non-linear regime, while it shows marginal agreement for power indices n=0 and +1 in the linear regime and poor agreement beyond this point. This suggests that tree-level perturbation theory (as realized in the LLA) can accurately predict the density distribution function for n<=-1, but fails for n>=0.Deep Learning Hype...rbolehttps:\/\/www.linkedin.com\/pulse\/deep-learning-hyperbole-zack-protogeros\/2017-11LinkedIn  articleUnited We Errhttps:\/\/www.linkedin.com\/pulse\/united-we-err-zack-protogeros\/2017-04LinkedIn articleNavigating Data Science Projectshttps:\/\/www.linkedin.com\/pulse\/navigating-data-science-projects-zack-protogeros\/2018-02LinkedIn article","16":"Internet of Things- Governance modelhttps:\/\/ieeexplore.ieee.org\/document\/79432122017-06Over the years Internet of Things-like environments have been gaining popularity. Increasingly, security and privacy issues have emerged as a major challenge to the wide-scale adoption of Internet of Things-like technologies. In this paper, we propose a basic model for managing governance and evaluate some considerations of Internet of Things-like environments.","17":"RGB image-based data analysis via discrete Morse theory and persistent homologyhttps:\/\/arxiv.org\/abs\/1801.095302018-02Abstract—Understanding and comparing images for the purposes of data analysis is currently a very computationally demanding task. A group at Australian National University (ANU) recently developed open-source code that can detect fundamental topological features of a grayscale image in a computationally feasible manner. This is made possible by the fact that computers store grayscale images as cubical cellular complexes. These complexes can be studied using the techniques of discrete Morse theory. We expand the functionality of the ANU code by introducing methods and software for analyzing images encoded in red, green, and blue (RGB), because this image encoding is very popular for publicly available data. Our methods allow the extraction of key topological information from RGB images via informative persistence diagrams by introducing novel methods for transforming RGB-to-grayscale. This paradigm allows us to perform data analysis directly on RGB images representing water scarcity variability as well as crime variability. We introduce software enabling a a user to predict future image properties, towards the eventual aim of more rapid image-based data behavior prediction.","18":"Biologically Inspired Augmented Memory Recall Model for Pattern Recognitionhttps:\/\/link.springer.com\/chapter\/10.1007\/978-3-319-94307-7_112018-05","19":"Interpreting and Evaluating CESIfo’s World Economic Survey’s Directional Forecastshttps:\/\/www.sciencedirect.com\/science\/article\/pii\/S026499931300535X2014-02Using the Carlson and Parkin (1975) framework and employing the Pesaran–Timmermann (1992) Predictive Failure statistic, we evaluate several consensus forecast series from CESIfo's World Economic Survey. Several issues are examined related to interpreting qualitative survey responses. We define what an “about the same” response implies across different economic variables, the value of agreement across the forecast panel, and how to maximize the signal value provided by the survey. We find that survey respondents provide statistically significant directional forecasts or signals.","20":"A Block Based Test Methodology (BBTM) for Verigy 93K Platformhttp:\/\/www.svtest.com\/docs\/TM-8%20A%20Block%20Based%20Test%20Methodology%20for%20Verigy%2093K%20Platform-S%20Jaldu%20A%20Alcorn.pdf2010-11\"Edge to Edge\" - Pre-Silicon Test Pattern Verification Toolhttp:\/\/www.svtest.com\/docs\/TM-13%20Edge%20to%20Edge%20-Pre%20Silicon%20Test%20Pattern%20Verification%20Tool-%20S%20Jaldu%20A%20Alcorn%20P%20Bajpai%20J%20Gossett.pdf2010-11","21":"San Francisco Crime Clustering and Spatial Analysis in Apache Sparkhttps:\/\/github.com\/yenchenchou\/Spark-Data-Clustering-and-Spatial-Data-Analysis-on-San-Francisco-Crime-Data2018-12• Established data processing pipeline through Spark DataFrame and utilized Spark SQL for crime incidents OLAP.• Reduced 11% potential crime rate through time series visualization and identified crime frequency for top 3 frequent crime category each month.• Programmed K-means clustering and optimized number of clusters through elbow method by sum of squared errors to specify high-risk crime areas in San Francisco.Mobile App Download Prediction and Fraudulent Click Traffic Detection2018-11• Construct data preprocessing and manipulation to detect click fraud through IP address, timestamp, and frequency of clicks.• Performed Logistic Regression, XGBoost, and  Recurrent Neural Network (RNN) to predict app download based on advertisements with 92% accuracy and 0.7 of recall on the XGBoost model.•  Optimized hyper-parameters and fine-tuned model performance via Grid-search method, ROC curve, and analyzed feature importance for key factor identification.Natural Language Processing and Topic Modeling on NBA Players’ Twitterhttps:\/\/towardsdatascience.com\/do-tweets-from-nba-leading-players-have-correlations-with-their-performance-7358c79aa2162018-11• Preprocessed text by tokenizing, stemming, emoji processing, and stop-words removing, and extracted features with TF-IDF approach.• Established unsupervised learning models of K-means clustering, Latent Dirichlet Allocation for player segmentation.• Identified correlation between players’ sentiment and game performance using sentiment analysis and web scraping.Health Alert App for Wearable Device2015-12• Mapped National Health Insurance Research Database data with Xiaomi band data to construct Cox regression model by implementing R.• Embedded Cox regression model and data visualization platform into self-built IOS APP for Xiaomi band.• Managed a team of 10 researchers to build motion detect system for an IOS App.Apache Spark Pet Owners Prediction on YouTube Commentshttps:\/\/github.com\/yenchenchou\/Apache-Spark-Pet-Owners-Prediction-on-YouTube-Comments2018-12• Formed data ETL and data preprocessing pipeline through Spark DataFrame and created label from YouTube comments in regular expression.• Executed data exploration analysis to map pets video creators and pet owners in Spark RDD for target advertising and implemented tokenizing, stop-words removing and word vectorization in Word2Vec method.• Trained and evaluated Logistic Regression and Gradient-Boost Trees via k-fold cross-validation and AUC score.• Utilized Logistic Regression model with 88% accuracy and 0.89 recall to predict pet owners through comments.Apache Spark Movie Recommendation Systemhttps:\/\/github.com\/yenchenchou\/Apache-Spark-MovieLens-Recommendation-System2019-01• Conducted data ETL pipeline to apply data preprocessing and data exploration analysis in Spark RDD, Spark SQL, and Spark DataFrame.• Performed Alternating Least Squares (ALS) for Collaborative filtering to customized movie recommendation.• Achieved hyper-parameters tuning through self-defined function and minimized 80% computation cost through monitoring learning curve from data visualization. ","22":"Thinking of Bid Evaluation Method of Bailey Portable Steel Bridges.http:\/\/d.wanfangdata.com.cn\/Periodical\/jzgc2016190022016A Study of the AHP-Based Operating-Life Bid Assessment Method for Portable Steel Bridgeshttp:\/\/d.wanfangdata.com.cn\/Periodical\/gfjtgcyjs2015060082015","23":"Predicting Vehicle Fuel Consumption Patterns Using Floating Vehicle Datahttp:\/\/doi.org\/10.1016\/j.jes.2017.03.0082017-03Analysis of Energy Consumption and Carbon Emission based on a large scale of Floating Vehicle Data (FVD)• Analyzed 30GB FVD using SPSS Modeler to explore fuel consumption and vehicle velocity distribution patterns in Beijing.• Conducted regression analysis on energy consumption and traffic flow rate using linear models and a multilayer perceptron (MLP).Large-Scale Short-Term Urban Taxi Demand Forecasting Using Deep Learninghttps:\/\/ieeexplore.ieee.org\/document\/82973612017-02• Leveraged skills in Big Query, Pandas, Map Reduce, and Matlab Tall array to clean, aggregate and transform 60 billion NYC taxi trip records (120 GB) into hundreds and thousands of snapshots of taxi demand across five boroughs of New York City.• Experimentally demonstrated the superiority of the proposed deep neural networks, namely the ST-ResNet, over many machine learning methods (Multivariate Regression, MLP, XGBoost, Random Forest) in city-wide taxi demand estimation. ","24":"Preserved cardiac function by vinculin enhances glucose oxidation and extends health- and life-spanhttps:\/\/aip.scitation.org\/doi\/full\/10.1063\/1.50195922018-07","25":"Improving Student Motivation through Competitive Active Learninghttp:\/\/davidanastasiu.net\/pdf\/papers\/2018-KapoorHA-FIE-clp.pdf2018 Improving Student Motivation through Competitive Active Learning. In 2018 IEEE Frontiers in Education Conference (FIE 2018), IEEE, 2018. Vehicle Tracking and Speed Estimation from Traffic Videoshttp:\/\/davidanastasiu.net\/pdf\/papers\/2018-HuaKA-CVPRW-aic18.pdf2018 Vehicle Tracking and Speed Estimation from Traffic Videos. In 2018 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW'18), IEEE, 2018. ","26":"•\tConstruction of Sparse Weighted Directed Network for Multivariate Time series•\tClassification of stuttering kids from non-stuttering byanalyzing fNIRS brain datahttps:\/\/ieeexplore.ieee.org\/document\/83444972018-04•\tClassification of prostate cancer tissues based on reflected lighthttps:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/24725579.2018.14423782018-04•\tPattern discovery in eye tracking data and low-cost EEG signals on judgement of the relevancyhttps:\/\/onlinelibrary.wiley.com\/doi\/abs\/10.1002\/asi.239042017-08•\tTotal inflow rate predictionhttps:\/\/ascelibrary.org\/doi\/abs\/10.1061\/(ASCE)EY.1943-7897.00001032013-06"}}